# 观察数据形式并对数据进行预处理
1. [Foursquare数据](https://sites.google.com/site/xueatalphabeta/academic-projects)已经下载好了。[本地路径](../../data/ml-1m/)
2. [MovieLens](http://grouplens.org/datasets/movielens/1m/)已经下载好了。[本地路径](../../data/Foursqare/)

In [1]:
import numpy as np
import pandas as pd

In [2]:
checkins_dataset = pd.read_csv("../../data/Foursqare/checkins.dat",sep="|")

D:\Python37\lib\site-packages\IPython\core\interactiveshell.py:3441: DtypeWarning: Columns (0) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [3]:
checkins_dataset.describe()

           user_id      venue_id
count  1.021966e+06  1.021966e+06
mean   1.227084e+06  1.502672e+05
std    6.638054e+05  2.440088e+05
min    1.000000e+00  1.000000e+00
25%    6.097910e+05  9.310000e+03
50%    1.380121e+06  3.216300e+04
75%    1.775918e+06  1.732980e+05
max    2.153502e+06  1.143020e+06

In [4]:
checkins_dataset.head(5)

,id,user_id,venue_id,latitude,longitude,created_at
0,984301,2041916.0,5222.0,,,2012-04-21 17:39:01
1,984222,15824.0,5222.0,38.8951118,-77.0363658,2012-04-21 17:43:47
2,984315,1764391.0,5222.0,,,2012-04-21 17:37:18
3,984234,44652.0,5222.0,33.800745,-84.41052,2012-04-21 17:43:43
4,984249,2146840.0,5222.0,,,2012-04-21 17:42:58